tap "azure/azure-workload-identity"
tap "azure/kubelogin"
tap "danielfoehrkn/switch"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "mike-engel/jwt-cli"
tap "nahive/spotify-notify"
tap "norwoodj/tap"
tap "powershell/tap"
tap "teamookla/speedtest"
tap "ynqa/tap"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Testing and linting Helm charts
brew "chart-testing"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cloud provider for KIND clusters
brew "cloud-provider-kind"
# Command-line tool to manage cert-manager
brew "cmctl"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line Golang template processor
brew "gomplate"
# Library access to GnuPG
brew "gpgme"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Command-line hex viewer
brew "hexyl"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive jq
brew "ijq"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Interactive JSON filter using jq
brew "jnv"
# Kubernetes YAML to Terraform HCL converter
brew "k2tf"
# Run local Kubernetes cluster in Docker
brew "kind"
# KubeConfig Manager
brew "kubecm"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# API Traffic Analyzer providing real-time visibility into Kubernetes network
brew "kubeshark"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Kubernetes WithOut Kubelet - Simulates thousands of Nodes and Clusters
brew "kwok"
# Kubernetes Native Policy Management
brew "kyverno"
# Java-based project management
brew "maven"
# Provides a formatted and highlighted view of Markdown files in Terminal
brew "mdless"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Provides a software solution to manage, store, and distribute sensitive data
brew "openbao"
# SDK for building Kubernetes applications
brew "operator-sdk"
# OCI Registry As Storage
brew "oras"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install various Ruby versions and implementations
brew "ruby-build"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Work with remote images registries
brew "skopeo"
# Shamir's secret sharing scheme implementation
brew "ssss"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "tenv"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Tetragon CLI to observe, manage and troubleshoot Tetragon instances
brew "tetra"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A utility CLI that helps manage Azure AD Workload Identity and automate error-prone operations:
brew "azure/azure-workload-identity/azwi"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# The kubectx for operators.
brew "danielfoehrkn/switch/switch"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Formula to install PowerShell
brew "powershell/tap/powershell"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# macOS notifications for Spotify
cask "spotify-notify"
# Network protocol analyzer
cask "wireshark-app"
cask "headlamp"
vscode "adpyke.codesnap"
vscode "albert.tabout"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "chrmarti.network-proxy-test"
vscode "davidanson.vscode-markdownlint"
vscode "dionmunk.vscode-notes"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "gamunu.opentofu"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "jflbr.jwt-decoder"
vscode "johnpapa.vscode-peacock"
vscode "lihui.vs-color-picker"
vscode "linhmtran168.mac-ca-vscode"
vscode "mechatroner.rainbow-csv"
vscode "meshintelligenttechnologiesinc.pieces-vscode"
vscode "mindaro-dev.file-downloader"
vscode "mobalic.jetbrains-new-dark"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "oderwat.indent-rainbow"
vscode "opentofu.vscode-opentofu"
vscode "pharndt.node-extra-ca-certs-vscode"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sst-dev.opencode"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "taneron.10xdev-theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "xcad2k.vscode-thedigitallife"
vscode "xrc-inc.jsonnet-formatter"
vscode "zhuangtongfa.material-theme"
vscode "zunix.edgerouter-conf"
vscode "zxh404.vscode-proto3"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
